<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class AdCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \DB::table('ad_categories')->insert([
            [
                'name' => 'miners',
                'title' => 'Купить оборудование для майнинга',
                'description' => 'Объявления о продаже оборудования для майнинга у проверенных компаний с доставкой по РФ. Цены, расчет доходности, реальные отзывы',
                'header' => 'Miners'
            ], [
                'name' => 'legals',
                'title' => 'Юристы по криптовалюте и майнингу',
                'description' => 'Нанять юриста или адвоката с лучшим рейтингом, специализирующегося в сфере майнинга',
                'header' => 'Legals'
            ], [
                'name' => 'containers',
                'title' => 'Купить контейнер для майнинга',
                'description' => 'Производители и дилеры контейнеров для майнинга с подготовленной вентиляцией и проводкой',
                'header' => 'Containers'
            ], [
                'name' => 'noiseboxes',
                'title' => 'Шумоизоляция для ASIC майнеров, шумобоксы',
                'description' => 'Купить шумобокс для майнингового оборудования с доставкой по РФ. Цены, размеры, характеристики, отзывы',
                'header' => 'Noiseboxes'
            ], [
                'name' => 'cryptoboilers',
                'title' => 'Криптокотлы, реализация тепла от майнинга',
                'description' => 'Обогрев дома с помощью майнинга, использование выделяемого тепла от ASIC майнеров',
                'header' => 'Cryptoboilers'
            ], [
                'name' => 'water_cooling_plates',
                'title' => 'Водоблоки: эффективное охлаждение ASIC майнера',
                'description' => 'Водяное охлаждение. Обогрев дома с помощью майнинга, использование выделяемого тепла от ASIC майнеров',
                'header' => 'Water cooling plates'
            ], [
                'name' => 'firmwares',
                'title' => 'Прошивки для асиков. Купить кастомное ПО',
                'description' => 'Магазин прошивок для современных асиков. Оптимизируйте свой майнер: автонастройка чипов, снижение шума и повышение эффективности. Скачивайте проверенное ПО для топовых моделей',
                'header' => 'Firmwares'
            ], [
                'name' => 'monitorings',
                'title' => 'Устройства для мониторинга асиков, удаленный контроль фермы',
                'description' => 'Контроллеры и хабы для мониторинга асиков в режиме реального времени. Автоматические уведомления о сбоях, контроль температуры и хешрейта. Управляйте майнинг-фермой из любой точки мира',
                'header' => 'Monitoring'
            ], [
                'name' => 'accessories',
                'title' => 'Комплектующие для ASIC майнеров',
                'description' => 'Расходники для асиков. Кабели питания, вентиляторы, патч-корды, чипы, хэш и контрольные платы, блоки питания и корпусы, все для ремонта и другое',
                'header' => 'Accessories'
            ], [
                'name' => 'gpus',
                'title' => 'ГПУ: каталог газопоршневых установок',
                'description' => 'Купить/заказать газопоршневую установку для своего хостинга',
                'header' => 'Gas piston units'
            ]
        ]);
    }
}
