<?php

return [
    'notifications' => [
        'on' => 'Включено',
        'directions' => [
            'e' => 'Email',
            't' => 'Телеграм',
        ],
        'settings' => [
            'f' => [
                'name' => 'Частота',
                'f' => 'Только первое за сутки',
                'a' => 'Каждое соообщение',
                '12h' => 'Каждые 12 часов',
                'd' => 'Ежедневно',
                '3d' => 'Раз в три дня',
                'c' => 'По изменению сложности',
            ],
            'c' => [
                'name' => 'Условие',
                'd' => 'Только снижение',
                'c' => 'Любое изменение',
                'n' => 'Только негативные',
                'a' => 'Все',
            ]
        ]
    ],
];
