<?php

return [
    'notifications' => [
        'enabled' => 'Включено',
        'directions' => [
            'email' => 'Email',
            'tg' => 'Телеграм',
        ],
        'settings' => [
            'frequency' => [
                'name' => 'Частота',
                'first' => 'Только первое за сутки',
                'all' => 'Каждое соообщение',
                '12h' => 'Каждые 12 часов',
                'd' => 'Ежедневно',
                '3d' => 'Раз в три дня',
                'change' => 'По изменению сложности',
            ],
            'condition' => [
                'name' => 'Условие',
                'drop' => 'Только снижение',
                'changing' => 'Любое изменение',
                'negative' => 'Только негативные',
                'all' => 'Все',
            ]
        ]
    ],
];
