<?php

return [
    'years' => 'год|года|лет',
    'months' => 'месяц|месяца|месяцев',
    'days' => 'день|дня|дней',
    'hours' => 'час|часа|часов',
    'minutes' => 'минута|минуты|минут',
    'seconds' => 'секунда|секунды|секунд',
    'period_choice' => 'каждый день|каждые :count дня|каждые :count дней',

    'weekdays' => [
        'mon' => 'Пн',
        'tue' => 'Вт',
        'wed' => 'Ср',
        'thu' => 'Чт',
        'fri' => 'Пт',
        'sat' => 'Сб',
        'sun' => 'Вс',
    ],

    'month_names' => [
        'january' => 'Январь',
        'february' => 'Февраль',
        'march' => 'Март',
        'april' => 'Апрель',
        'may' => 'Май',
        'june' => 'Июнь',
        'july' => 'Июль',
        'august' => 'Август',
        'september' => 'Сентябрь',
        'october' => 'Октябрь',
        'november' => 'Ноябрь',
        'december' => 'Декабрь'
    ]
];