<?php

return [
    'directions' => [
        'miners' => 'Продажа оборудования',
        'legals' => 'Юридические услуги',
        'containers' => 'Торговля контейнерами',
        'cryptoboilers' => 'Торговля криптокотлами',
        'noiseboxes' => 'Производство шумобоксов',
        'firmwares' => 'Разработка ПО',
        'gpus' => 'Продажа ГПЭС',
        'hosting' => 'Майнинг отель',
        'service' => 'Ремонт оборудования',
        'exchanger' => 'Обмен криптовалюты',
    ],

    'factors' => [
        'company_exists' => [
            'title' => 'Проверка компании',
            'description' => 'Продавец подтвердил компанию через государственные реестры'
        ],
        'legal_entity' => [
            'title' => 'Юридическое лицо',
            'description' => 'Компания зарегистрирована как юридическое лицо'
        ],
        'company_status' => [
            'title' => 'Статус компании',
            'description' => 'Компания действует по данным официальных реестров'
        ],
        'branches' => [
            'title' => 'Филиалы',
            'description' => 'У компании есть официально зарегистрированные филиалы'
        ],
        'invalid_registry_data' => [
            'title' => 'Достоверность сведений',
            'description' => 'В реестрах есть отметка о недостоверности сведений'
        ],
        'registry' => [
            'title' => 'Реестр майнеров ФНС',
            'description' => 'Компания состоит в реестре майнеров'
        ],
        'visiting_territory' => [
            'title' => 'Посещение хостинга',
            'description' => 'Компания допускает на территорию хостинга'
        ],
        'registration_age' => [
            'title' => 'Возраст компании',
            'description' => 'Время, прошедшее с момента регистрации компании'
        ],
        'website' => [
            'title' => 'Официальный сайт',
            'description' => 'Компания указала официальный сайт'
        ],
        'video' => [
            'title' => 'Видео о компании',
            'description' => 'Компания разместила видео'
        ],
        'images' => [
            'title' => 'Фотографии компании',
            'description' => 'Фотографии повышают прозрачность'
        ],
        'reviews' => [
            'title' => 'Отзывы клиентов',
            'description' => 'Средний рейтинг по подтвержденным отзывам'
        ],
        'fake_reviews' => [
            'title' => 'Поддельные отзывы',
            'description' => 'Обнаружены искусственные отзывы'
        ],
        'offices' => [
            'title' => 'Проверенные офисы',
            'description' => 'Подтвержденные офисы повышают доверие'
        ],
        'unique_content' => [
            'title' => 'Уникальность объявлений',
            'description' => 'Уникальные изображения и описания повышают доверие'
        ],
        'response_time' => [
            'title' => 'Среднее время ответа',
            'description' => 'Как быстро продавец отвечает на сообщения'
        ],
        'income' => [
            'title' => 'Официальный доход',
            'description' => 'Доходы по бух. отчетности'
        ],
        'capital' => [
            'title' => 'Уставный капитал',
            'description' => 'Официально подтвержденный уставный капитал компании'
        ],
        'employees' => [
            'title' => 'Количество сотрудников',
            'description' => 'Только официально зарегистрированные сотрудники'
        ],
    ]
];
